// From MacBuddy
// ---------------------------------------------------------------------
// * Buttons
// ---------------------------------------------------------------------
"OK_BUTTON"		= "好";
"CANCEL_BUTTON"		= "取消";
"GOBACK_BUTTON"		= "返回";
"DIAGNOSE_BUTTON"	= "诊断";

// ---------------------------------------------------------------------
// * Progress message
// ---------------------------------------------------------------------
"MESSAGE_CONFIGURING"		= "正在配置您的电脑…";
"MESSAGE_PREP_CONNECTION"	= "正在准备连接…";

// ---------------------------------------------------------------------
// * Fatal error
// ---------------------------------------------------------------------
"FATAL_ERROR_PANEL_TITLE"		= "意外错误";
"MESSAGE_FATAL_ERROR_TITLE"		= "对不起，发生了意外错误。";

// ---------------------------------------------------------------------
// * Generic error
// ---------------------------------------------------------------------
"GENERIC_ERROR_PANEL_TITLE"				= "错误";
"ERROR_MESSAGE_GENERIC_TITLE"			= "对不起…";


// ---------------------------------------------------------------------
// * Data Validation
// ---------------------------------------------------------------------
"ERROR_MESSAGE_VALIDATION_FAILED_TITLE" = "对不起";
"ERROR_MESSAGE_VALIDATION_WARNING_TITLE" = "警告";
"ERROR_MESSAGE_VALIDATION_WARNING" = "您要继续吗？";

                    // Required field
"ERROR_MESSAGE_VALIDATION_0001_TITLE" = "您没有提供要求的所有信息。";
"ERROR_MESSAGE_VALIDATION_0001" = "请核对标有红色箭头的栏位，然后输入要求的信息。";

                    // Min-length field
"ERROR_MESSAGE_VALIDATION_0002_TITLE" = "您输入的文本太短。";
"ERROR_MESSAGE_VALIDATION_0002" = "请核对高亮显示的栏位，然后纠正输入的文本。";

                    // Matching fields (e.g. password)
"ERROR_MESSAGE_VALIDATION_0003" = "您输入的信息不正确。";

                    // NI Username invalid
"ERROR_MESSAGE_VALIDATION_0004_TITLE" = "您输入的用户名称无效。";
"ERROR_MESSAGE_VALIDATION_0004" = "请核对高亮显示的栏位，然后输入一个有效的 NetInfo 网络用户名称。";

                    // NI Password invalid
"ERROR_MESSAGE_VALIDATION_0005_TITLE" = "您输入的密码不正确。";
"ERROR_MESSAGE_VALIDATION_0005" = "请核对高亮显示的栏位，然后输入正确的密码。";

                    // UnixName invalid		-- refer to UsersPref
"ERROR_MESSAGE_VALIDATION_0006_TITLE" = "您输入的名称不能用。";
"ERROR_MESSAGE_VALIDATION_0006" = "请核对高亮显示的栏位，然后选取另一个短名称。";
"ERROR_MESSAGE_VALIDATION_0007" = "已有用户使用了这个短名称。请输入另一个短名称。";

                    // IPAddress invalid	-- refer to Open Transport
					// "ERROR_MESSAGE_VALIDATION_0008" - NSIPAddressIsValid
"ERROR_MESSAGE_VALIDATION_0009" = "您输入的 IP 地址是空的。";
"ERROR_MESSAGE_VALIDATION_0010" = "您输入的 IP 地址包含无效字符。";
"ERROR_MESSAGE_VALIDATION_0011_TITLE" = "地址必须包含 4 段。"; // too few segments
"ERROR_MESSAGE_VALIDATION_0011" = "请核对高亮显示的栏位，然后输入一个有效的地址。如果您不知道此信息，请询问网络管理员。";
"ERROR_MESSAGE_VALIDATION_0012_TITLE" = "地址必须包含 4 段。"; // too many segments
"ERROR_MESSAGE_VALIDATION_0012" = "请核对高亮显示的栏位，然后输入一个有效的地址。如果您不知道此信息，请询问网络管理员。";
"ERROR_MESSAGE_VALIDATION_0013_TITLE" = "每个地址段必须包含 1 到 3 个字符。"; // no segments
"ERROR_MESSAGE_VALIDATION_0013" = "请核对高亮显示的栏位，然后输入一个有效的地址。如果您不知道此信息，请询问网络管理员。";
"ERROR_MESSAGE_VALIDATION_0014_TITLE" = "不允许输入这样的地址。";
"ERROR_MESSAGE_VALIDATION_0014" = "请核对高亮显示的栏位，然后输入一个有效的地址。如果您不知道此信息，请询问网络管理员。";

                    // SubnetMask invalid
"ERROR_MESSAGE_VALIDATION_0015_TITLE" = "您输入的子网掩码无效。";
"ERROR_MESSAGE_VALIDATION_0015" = "请核对高亮显示的栏位，然后输入一个有效的子网掩码。如果您不知道此信息，请询问网络管理员。";

                    // notNIUsername
"ERROR_MESSAGE_VALIDATION_0016" = "您输入的名称已存在于 NetInfo 网络中。您不能使用该用户名称登录 NetInfo。";

                    // Unique fields
"ERROR_MESSAGE_VALIDATION_0017" = "不能使用相同的数值。";

                    // Wireless Network password
"ERROR_MESSAGE_VALIDATION_0018" = "您输入的密码无效。";

"ERROR_MESSAGE_VALIDATION_0019_TITLE" = "您输入的信用卡号码不能使用。";
"ERROR_MESSAGE_VALIDATION_0019" = "请核对高亮显示的栏位，然后输入一个有效的信用卡号码。";

                    // Account name
"ERROR_MESSAGE_VALIDATION_0020" = "帐户名称不能以数字开头。";

                    // EMail address
"ERROR_MESSAGE_VALIDATION_0021" = "您输入的电子邮件地址可能是不能用的。";

                    // SubnetMask & IPAddress, Router consistency check
"ERROR_MESSAGE_VALIDATION_0022" = "IP 地址和路由器地址与您输入的子网掩码不一致。请核对以下栏位，并输入有效的数值:\n     IP 地址\n     子网掩码\n     路由器地址\n如果您不知道这些信息，请询问网络管理员。";

                    // Wrong long username
"ERROR_MESSAGE_VALIDATION_0023_TITLE" = "您输入的名称不能用。";
"ERROR_MESSAGE_VALIDATION_0023" = "请检查高亮显示的栏位，然后选用其他名称。";

                    // Unique Array
"ERROR_MESSAGE_VALIDATION_0024_TITLE" = "有重复的值。";
"ERROR_MESSAGE_VALIDATION_0024" = "请核对高亮显示的栏位，然后输入唯一的值。";

// ---------------------------------------------------------------------
// * System Configuration
// ---------------------------------------------------------------------
"MESSAGE_NO_DIAL_TONE_TITLE"			= "调制解调器检测不到拨号音。";
"MESSAGE_NO_DIAL_TONE"					= "请确定调制解调器已连接好，然后点按“好”。或者点按“取消”返回，然后选择“忽略拨号音”注记格。";

// ========== Network Setup Assistant addition ==========
"QUIT_BUTTON"		= "退出";
                                        // Field specific errors
"ERROR_PASSWORD_DO_NOT_MATCH_TITLE" = "密码不匹配";
"ERROR_PASSWORD_DO_NOT_MATCH" = "请核对标有红色箭头的栏位，然后在两栏中输入相同的密码。";

"ERROR_MUST_ENTER_LOCATION_NAME_TITLE" = "请输入位置名称。";
"ERROR_MUST_ENTER_LOCATION_NAME" = "您正创建一个新的网络位置来存储配置信息。现在您必须输入一个位置名称。";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME_TITLE" = "请输入另一个位置名称。";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME" = "您输入的位置名称已经存在。请输入不同的名称。";


"MESSAGE_TASK_FORMAT" = "“%1$@ 连接经由 %2$@”"; // %1$@ = CONNECTION, %2$@ = CONFIGURATION
"CONNECTION_Wireless" = "无线";
"CONNECTION_Modem" = "调制解调器";
"CONNECTION_DSL" = "DSL";
"CONNECTION_CableModem" = "线缆调制解调器";
"CONNECTION_Lan" = "局域网";
"CONFIGURE_PPP" = "PPP";
"CONFIGURE_DHCP" = "DHCP";
"CONFIGURE_DHCPClientID" = "带客户 ID 的 DHCP";
"CONFIGURE_PPPoE" = "PPPoE";
"CONFIGURE_Manual" = "静态 IP";

"MESSAGE_TITLE_CONFIGURE" = "正在配置…";
"MESSAGE_FAILED_CONFIGURE" = "配置失败。";
"MESSAGE_DONE_CONFIGURE" = "配置完成。";
"MESSAGE_CHECKING_CONNECTION" = "正在检查您的网络连接…";
"MESSAGE_CONNECTED" = "已建立网络连接。";
"MESSAGE_NOT_CONNECTED" = "无法建立网络连接。";
"MESSAGE_NOT_CONNECTED_TRY_AGAIN" = "您的电脑没有接入 Internet。请点按“好”以返回并更改您的网络设置，然后重新尝试。";

"DEFAULT_LOCATION_NAME" = "位置（%@）";
"DUPLICATE_LOCATION_NAME" = "%1$@ %2$d";